In [1]:
import pandas as pd
import numpy as np
df = pd.read_excel('score.xlsx',index_col='지원번호')

In [2]:
df

       이름    학교    키   국어   영어   수학  과학  사회        SW특기
지원번호
1번    강나래   구로고  197   90   85  100  95  85      Python
2번    강태원   구로고  184   40   35   50  55  25        Java
3번    강호림   구로고  168   80   75   70  80  75  Javascript
4번    김수찬   구로고  187   40   60   70  75  80         NaN
5번    김재욱   구로고  188   15   20   10  35  10         NaN
6번    박동현  디지털고  202   80  100   95  85  80           C
7번    박혜정  디지털고  188   55   65   45  40  35      PYTHON
8번    승근열  디지털고  190  100   85   90  95  95          C#

In [3]:
df.groupby('학교').count()

      이름  키  국어  영어  수학  과학  사회  SW특기
학교
구로고    5  5   5   5   5   5   5     3
디지털고   3  3   3   3   3   3   3     3

In [4]:
df.groupby('학교').describe()

         키                                                              국어  \
     count        mean        std    min    25%    50%    75%    max count
학교
구로고    5.0  184.800000  10.568822  168.0  184.0  187.0  188.0  197.0   5.0
디지털고   3.0  193.333333   7.571878  188.0  189.0  190.0  196.0  202.0   3.0

                 ...    과학          사회                                     \
           mean  ...   75%   max count  mean        std   min   25%   50%
학교               ...
구로고   53.000000  ...  80.0  95.0   5.0  55.0  34.820971  10.0  25.0  75.0
디지털고  78.333333  ...  90.0  95.0   3.0  70.0  31.224990  35.0  57.5  80.0


       75%   max
학교
구로고   80.0  85.0
디지털고  87.5  95.0

[2 rows x 48 columns]

In [5]:
### 그룹화
# 해당되는 그룹의 리스트 보여줌
# df.groupby('학교').get_group('구로고')
# df.groupby('학교').mean()
df.groupby('학교').size()  # 해당 학교 학생수 확인 
df.groupby('학교').size()['구로고']  
df.groupby('학교').size()['디지털고']  
df.groupby('학교')['키'].mean()  # 학교별 키의 평균값 출력

학교
구로고     184.800000
디지털고    193.333333
Name: 키, dtype: float64

In [6]:
df.groupby('학교').get_group('디지털고')

       이름    학교    키   국어   영어  수학  과학  사회    SW특기
지원번호
6번    박동현  디지털고  202   80  100  95  85  80       C
7번    박혜정  디지털고  188   55   65  45  40  35  PYTHON
8번    승근열  디지털고  190  100   85  90  95  95      C#

In [7]:
df.groupby('학교').size()

학교
구로고     5
디지털고    3
dtype: int64

그룹별로 최대값,최소값,평균,합계

In [8]:
# 학교 그룹별 - 키 평균 출력
df.groupby('학교')['키'].mean()
# 학교 그룹별 - 키,국어점수 평균 출력
df.groupby('학교')[['키','국어']].mean()
df.groupby('학교')['키'].max()

학교
구로고     197
디지털고    202
Name: 키, dtype: int64

In [9]:
# 컬럼별 최대값,최소값,평균,합계,표준편차
df['키'].mean()

np.float64(188.0)

In [10]:
df.groupby('학교') # 그룹이 됨.
df.groupby('학교')['키'].mean()

학교
구로고     184.800000
디지털고    193.333333
Name: 키, dtype: float64

In [11]:
# 컬럼을 추가
df['학년'] = [3,3,2,1,3,2,2,1]

In [12]:
df.groupby(['학교','학년']).size()

학교    학년
구로고   1     1
      2     1
      3     3
디지털고  1     1
      2     2
dtype: int64

In [13]:
df.groupby('학교')[['이름','SW특기']].count()

      이름  SW특기
학교
구로고    5     3
디지털고   3     3

In [14]:
df.groupby('학교').count()
df.groupby('학년')['이름'].count()

학년
1    2
2    3
3    3
Name: 이름, dtype: int64

In [15]:
df.groupby('학년').sum().sort_values('키')
df.groupby('학교').sum().sort_values('키')
df.groupby('학교')['키'].max()

학교
구로고     197
디지털고    202
Name: 키, dtype: int64

In [16]:
### 그룹화
# 컬럼을 기준으로 그룹핑 -  df.groupby(컬럼) : sum():합계,count():개수,size():크기
df.groupby('학교').count()
df.groupby(['학교','학년']).count()
df['학교'].value_counts()
# 컬럼지정필요 : df.groupby(컬럼)[숫자타입컬럼]  mean(),max(),min()
df.groupby('학교')['키'].min()
df.groupby('학교')[['키','국어']].min()

### 그룹별 키로 정렬 , ascending=False : 역순정렬
df.groupby('학년')['키'].mean().sort_values(ascending=False)

### value_count() : 그룹핑 개수
df.groupby('학교')['학년'].value_counts().loc['구로고']
df.groupby('학교')['학년'].value_counts(normalize=True).loc['구로고']

학년
3    0.6
1    0.2
2    0.2
Name: proportion, dtype: float64

In [17]:
# df.groupby('학교').min()
df['학교'].value_counts()

학교
구로고     5
디지털고    3
Name: count, dtype: int64

In [18]:
# 학교로 그룹핑 학년으로 학생수 출력
## 그룹핑을 했을때 사용되는 개수
df.groupby('학교')['학년'].value_counts()

학교    학년
구로고   3     3
      1     1
      2     1
디지털고  2     2
      1     1
Name: count, dtype: int64

In [19]:
### 학교로 그룹핑을 해서 구로고 학생만 학년으로 학생수 출력
df.groupby('학교')['학년'].value_counts().loc['구로고']
# 퍼센트로 출력됨 : normalize=True
df.groupby('학교')['학년'].value_counts(normalize=True).loc['구로고']

학년
3    0.6
1    0.2
2    0.2
Name: proportion, dtype: float64

In [20]:
# (학교)구로고 학생의 키의 합계를 구하시오.
df.groupby('학교')['키'].sum()

학교
구로고     924
디지털고    580
Name: 키, dtype: int64

In [21]:
df_s = df.groupby('학교').sum()

In [22]:
df_s.loc[df.groupby('학교')['키'].sum()>600]

                  이름    키   국어   영어   수학   과학   사회                  SW특기  학년
학교
구로고  강나래강태원강호림김수찬김재욱  924  265  275  300  340  275  PythonJavaJavascript  12

In [28]:
df.groupby('학교')['키'].mean()
df.groupby('학교')['키'].min()
df.groupby('학교')['키'].max()
df.groupby('학교')['키'].sum()
df.groupby('학교')['키'].agg(['mean','min','max','sum'])

            mean  min  max  sum
학교
구로고   184.800000  168  197  924
디지털고  193.333333  188  202  580

In [35]:
df['학교'].value_counts()

학교
구로고     5
디지털고    3
Name: count, dtype: int64